package az.babayev.javarush.exercise;

/*
Представьте, что вы создаёте игру и хотите задать возраст главного героя.
Объявите переменную типа int с именем heroAge и присвойте ей значение 25.
Выведите это значение на экран. Создание и присваивание должно быть выполнено в одной строке.
*/
public class Task1 {

    static void main() {
        int heroAge = 25;
        System.out.println(heroAge);
    }
}
