package az.babayev.javarush.exercise.level2;

/*
Вы хотите вывести цитату героя, который сказал: "Поехали!".
Создайте переменную типа String с именем heroQuote. Присвойте ей это значение, используя экранирование кавычек, и выведите heroQuote на экран.
*/
public class Task7 {
    static void main() {
        String heroQuote = "\"Поехали!\"";
        System.out.println(heroQuote);

    }
}
