package az.babayev.javarush.exercise.level1;

/*
Создайте переменную типа String с именем myMessage. Присвойте ей значение "I ❤️ YOU". Выведите это сообщение на экран.
* */
public class Task5 {

    static void main() {
        String myMessage="I ❤\uFE0F YOU";
        System.out.println(myMessage);
    }

}
